app/views/messages/_message.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
  <p>
    <% if message.user.present? %>