app/views/rooms/_form.html.erb

        <%= form.label :user_ids, "Select Users" %><br>
        <%= form.collection_check_boxes :user_ids, User.all, :id, :email do |b| %>
---
SELECT "users".* FROM "users"