app/views/rooms/index.html.erb

    <% if user_signed_in? %>
      <%= render partial: 'form', locals: { room: Room.new(name: "Room #{Room.count + 1} ") } %>
---
SELECT "rooms".* FROM "rooms"
SELECT COUNT(*) FROM "rooms"