app/controllers/messages_controller.rb

  def index
    if params[:room_id]
      @room = Room.find(params[:room_id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = 1 LIMIT 1

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("content", "room_id", "created_at", "updated_at", "user_id") VALUES ('qwdqd', 1, '2025-05-04 14:09:46.459791', '2025-05-04 14:09:46.459791', 1) RETURNING "id"