app/controllers/rooms_controller.rb

  def index
    @rooms = Room.all

    @room = @rooms[0] unless @rooms.empty?
---
SELECT "rooms".* FROM "rooms"
SELECT 1 AS one FROM "rooms" LIMIT ?  [["LIMIT", 1]]