app/controllers/rooms_controller.rb

  def index
    @rooms = Room.all

    @room = @rooms[0] unless @rooms.empty?
    @messages =[]
    @messages = @room.messages unless @rooms.empty?
---
SELECT 1 AS one FROM "rooms" LIMIT 1

  def create
    @room = Room.new(room_params)
    @room.user_ids = params[:room][:user_ids]

    respond_to do |format|
      if @room.save
---
INSERT INTO "room_users" ("room_id", "user_id", "created_at", "updated_at") VALUES (1, 1, '2025-05-04 14:09:41.453937', '2025-05-04 14:09:41.453937') RETURNING "id"
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES ('Room 1 ', '2025-05-04 14:09:41.441746', '2025-05-04 14:09:41.441746') RETURNING "id"

    def set_room
      @room = Room.find(params.expect(:id))
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = 1 LIMIT 1