app/models/room.rb

INSERT INTO "room_users" ("room_id", "user_id", "created_at", "updated_at") VALUES (1, 1, '2025-05-04 14:09:41.453937', '2025-05-04 14:09:41.453937') RETURNING "id"
---
  def assign_users
    return unless user_ids.present?

    user_ids.reject(&:blank?).each do |uid|
      RoomUser.create(room_id: id, user_id: uid)